; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link joint angle)

(:predicates
	(Connected ?j - joint ?l - link) 
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?a - angle ?j - joint)
	(Affected ?j - joint ?l - link ?j1 - joint)
	(Fixed ?l - link)
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint  ?link2)
	(not (Fixed ?link1))
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?joint)) 
	    (HasAngle ?a2 ?joint)
	    (forall (?js - joint ?a3 ?a4 - angle )
		    (when (and (Affected ?js ?link1 ?joint) (not (= ?js ?joint)) (HasAngle ?a3 ?js) (AngleOrd ?a3 ?a4))
		        (and
			        (not (HasAngle ?a3 ?js))
			        (HasAngle ?a4 ?js)
		        )
		    )
	    )
    )
)


(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint  ?link2)
	(not (Fixed ?link1))
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a2 ?a1)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?joint)) 
	    (HasAngle ?a2 ?joint)
	    (forall (?js - joint ?a3 ?a4 - angle )
		    (when (and (Affected ?js ?link1 ?joint) (not (= ?js ?joint)) (HasAngle ?a3 ?js) (AngleOrd ?a4 ?a3))
		        (and
			        (not (HasAngle ?a3 ?js))
			        (HasAngle ?a4 ?js)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_3)
(:domain joint_bar)
(:objects
    link_ground link1 link2 link3 - link
    joint1 joint2 joint3 - joint
    angle0 angle90 angle180 angle270 - angle)
(:init
    (AngleOrd angle0 angle90)
    (AngleOrd angle90 angle180)
    (AngleOrd angle180 angle270)
    (AngleOrd angle270 angle0)

    (Affected joint1 link1 joint2)
    (Affected joint1 link2 joint3)
    (Affected joint2 link1 joint1)
    (Affected joint2 link2 joint3)
    (Affected joint3 link1 joint1)
    (Affected joint3 link2 joint2)

    (Connected joint1 link_ground)
    (Connected joint1 link1)
    (Connected joint2 link1)
    (Connected joint2 link2)
    (Connected joint3 link2)
    (Connected joint3 link3)

    (Fixed link_ground)

    (HasAngle angle90 joint1)
    (HasAngle angle0 joint2)
    (HasAngle angle0 joint3)
)
(:goal
(and
    (HasAngle angle180 joint1)
    (HasAngle angle0 joint2)
    (HasAngle angle180 joint3)
    )
)
)

; plan
1. (increase_angle link2 link3 joint3 angle0 angle90)
   deleted: (hasangle angle0 joint3) (hasangle angle90 joint1) (hasangle angle0 joint2)
   added: (hasangle angle90 joint3) (hasangle angle180 joint1) (hasangle angle90 joint2)
   goals met: 1 of 3
2. (increase_angle link3 link2 joint3 angle90 angle180)
   deleted: (hasangle angle90 joint3)
   added: (hasangle angle180 joint3)
   goals met: 2 of 3
3. (increase_angle link3 link2 joint3 angle180 angle270)
   deleted: (hasangle angle180 joint3)
   added: (hasangle angle270 joint3)
   goals met: 1 of 3
4. (decrease_angle link2 link1 joint2 angle90 angle0)
   deleted: (hasangle angle90 joint2) (hasangle angle270 joint3)
   added: (hasangle angle0 joint2) (hasangle angle180 joint3)
   goals met: 3 of 3
